public class Draft0_Whole_Video_1_3_1 {
    public static void main(String[] args) {
        System.out.println("Задание : \n1.\tСоздайте классы с полями для описания структуры университета." +
                "\n\nРешение: ");
// ООП ( Объектно-ориентированное программирование ) - это всего лишь способ организовать
// код, сделать его не одной подряд просстынёй, подряд идущей, а разбить его на разные
// кусочки.

// сколько экземпляров класса у нас будет (Котов, Файлов, итд) - столько роз надо написать new
// Класс - описание структуры, например - какие есть поля.
// Экземпляр класса - уже реальный объект, который имеет значения (имя, возраст итд)
// Инстанс класса (closs instance) - синоним экзмепляру класса


//  видео мин 11 43: Про создание класса File
//  видео мин 12 05 Создать Class ( File )
//  видео мин 12 49 Посмотреть, в дебаге в калькуляторе что есть по объекту file и потом по этим пунктам создать классы
//  видео мин 26 18: Кошки - первое упоминание
//  видео мин 27 25: Кошки - второе упоминание


//        видео мин 50 05
//        for (int i = 0; i < filelnfos.length; j++) {
//            System.out.println("file " + i + " + fileInfos[i].fileName);
//                    Filelnfornation currentlnfo = filelnfos[i];
//            long currentFileSize = currentlnfo.size;
//            if (currentFileSize > maxSize) {
//                maxSize = currentFileSize;
//            }
//        }
    }
}